app/views/race/new.html.erb

        <%= form.label 'Track:' %>
        <%= form.select :track, options_for_select(@tracks), {prompt: 'Select Race'}, {class: "form-control", required: 'required'} %>
---
SELECT "tracks".* FROM "tracks"