app/controllers/race_controller.rb

  def new
    @tracks = Track.all().pluck(:name)
---
SELECT "tracks"."id", "tracks"."name" FROM "tracks"

  def create
    data = params[:data]
    name = params[:track].downcase
    season_id = params[:season_number]
    track_id = Track.find_by(name: params[:track]).id
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."name" = $1 LIMIT $2  [["name", "Canada"], ["LIMIT", 1]]

      }
    end

    Race.create(race_result)
---
INSERT INTO "races" ("track_id", "position", "driver", "team", "grid", "best", "milliseconds", "time", "created_at", "updated_at", "season_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"